# --------------------------------------------------------------------------------
# Инструменты агента
# --------------------------------------------------------------------------------
# Импорты
# --------------------------------------------------------------------------------


from database.engine import session_maker
from database.orm_query import execute_query


# --------------------------------------------------------------------------------
# Код инструментов
# --------------------------------------------------------------------------------


async def query_tool(query_plan_input: dict) -> str:
    """
    Асинхронный инструмент, который получает QueryPlan (dict), передаёт его в исполнитель ORM 
    и возвращает одно число.
    """

    query_plan = query_plan_input["query_plan"]

    # Создаём сессию внутри инструмента
    async with session_maker() as session:
        result = await execute_query(query_plan, session)

    print(str(result))
    return str(result)
