# --------------------------------------------------------------------------------
# Модуль обработки команд из приватных чатов
# --------------------------------------------------------------------------------
# Импорты
# --------------------------------------------------------------------------------

from aiogram import types, Router

from aiogram.filters import CommandStart



user_private_router = Router()


# --------------------------------------------------------------------------------
# Обработчики
# --------------------------------------------------------------------------------



# Стартовая команда
@user_private_router.message(CommandStart())
async def start_cmd(message: types.Message):
    await message.answer("Для работы с ботом введите вопрос на естественном русском языке")




